src/cf/DataProcessors/ор_СозданиеЯчеек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ор_СозданиеЯчеек</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоИзмерений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Измерения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Префикс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Постфикс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальнаяПозиция</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/ор_СозданиеЯчеек/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Вызов из формы списка ячеек с отбором по складу
	Если Параметры.Свойство("Склад") Тогда
		Объект.Склад = Параметры.Склад;
		Элементы.Склад.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КоличествоИзмеренийПриИзменении(Элемент)
	
	ТекущееКоличествоИзмерений = Объект.Измерения.Количество();
	
	Если ТекущееКоличествоИзмерений < Объект.КоличествоИзмерений Тогда
		ДобавитьСтрокиВТаблицуИзмерений(ТекущееКоличествоИзмерений);
	ИначеЕсли ТекущееКоличествоИзмерений > Объект.КоличествоИзмерений Тогда
		УдалитьСтрокиТаблицыИзмерений(ТекущееКоличествоИзмерений);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - Обработка кнопки Создать ячейки 
//
&НаКлиенте
Процедура СоздатьЯчейки(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Склад) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен склад!",,"Склад","Объект",Истина);
		Возврат;
	КонецЕсли;
	
	Если Объект.КоличествоИзмерений = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены измерения!",,"КоличествоИзмерений","Объект",Истина);
		Возврат;
	КонецЕсли;
	
	ШаблонСообщенияКоличество = НСтр("ru='Не заполнена колонка ""Количество"" в строке %НомерСтроки%.'");
	ШаблонСообщенияПозиция = НСтр("ru='Не заполнена колонка ""Начальная позиция"" в строке %НомерСтроки%.'");
	
	Отказ = Ложь;
	
	Для Каждого СтрокаТаблицы Из Объект.Измерения Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.НачальнаяПозиция) Тогда
			
			Отказ = Истина;
			ТекстСообщения = СтрЗаменить(ШаблонСообщенияПозиция, "%НомерСтроки%", СтрокаТаблицы.НомерСтроки);
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Измерения", СтрокаТаблицы.НомерСтроки, "НачальнаяПозиция");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Поле,"Объект", Отказ);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			
			Отказ = Истина;
			ТекстСообщения = СтрЗаменить(ШаблонСообщенияКоличество, "%НомерСтроки%", СтрокаТаблицы.НомерСтроки);
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Измерения", СтрокаТаблицы.НомерСтроки, "Количество");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Поле,"Объект", Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не Отказ Тогда
		
		Результат = СоздатьЯчейкиСервер();
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ПослеЗакрытияПредупреждения", ЭтотОбъект),Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждения(ДополнительныеПараметры = Неопределено) Экспорт
	
	ОповеститьОбИзменении(ПредопределенноеЗначение("Справочник.ор_Ячейки.ПустаяСсылка"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РедактированиеТаблицыИзмерений

&НаКлиенте
Процедура ДобавитьСтрокиВТаблицуИзмерений(КоличествоСтрок)
	
	Для Сч = КоличествоСтрок По Объект.КоличествоИзмерений-1 Цикл
		НоваяСтрока = Объект.Измерения.Добавить();
		НоваяСтрока.Количество = 1;
		НоваяСтрока.НачальнаяПозиция = 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокиТаблицыИзмерений(КоличествоСтрок)
	
	Если КоличествоСтрок <> 0 Тогда
		Сч = КоличествоСтрок;
		Пока Сч<>Объект.КоличествоИзмерений Цикл
			Объект.Измерения.Удалить(Сч-1);
			Сч = Сч-1;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеЯчеек

// Выполнить создание ячеек согласно заданным параметрам в таблице
// 
// Возвращаемое значение: Строка оповещения
//
&НаКлиенте
Функция СоздатьЯчейкиСервер()
	
	Результат = "";
	БылиОшибкиПриСозданииЯчеек = Ложь;
	
	ТекстОшибки = "";
	ОбходСтрокТаблицы(0, "", Объект.Измерения.Количество()-1,Результат,0, ТекстОшибки);

	Возврат Результат;
	
КонецФункции

// Процедура - Обход строк таблицы 
//
// Параметры:
//  ИндексСтроки			 - Число - Индекс для получения строки таблицы измерений
//  НазваниеЯчейки	 		 - Строка - Накапливаемое название ячейки 
//  МаксУровень				 - Число -  Максимальный уровень таблицы измерений
//  Результат				 - Строка - Строковый результат выполнения операции создания ячеек
//  КоличествоСозданныхЯчеек - Число - Количество созданных ячеек
//
&НаСервере
Процедура ОбходСтрокТаблицы(ИндексСтроки, НазваниеЯчейки, МаксУровень, Результат, КоличествоСозданныхЯчеек, ТекстОшибки)
	
	ТекущаяСтрока = Объект.Измерения.Получить(ИндексСтроки);
	
	Для ИндексДоч = ТекущаяСтрока.НачальнаяПозиция По ТекущаяСтрока.Количество-1 + ТекущаяСтрока.НачальнаяПозиция Цикл
		
		Если ИндексСтроки <> 0 Тогда 
			Наименование = НазваниеЯчейки + "_" + ТекущаяСтрока.Префикс + ИндексДоч + ТекущаяСтрока.Постфикс;
		Иначе 
			Наименование = НазваниеЯчейки + ТекущаяСтрока.Префикс + ИндексДоч + ТекущаяСтрока.Постфикс; 
		КонецЕсли; 
		
		Если ИндексСтроки = МаксУровень Тогда
			
			НаименованиеЯчейки = НазваниеЯчейки + "_" + ТекущаяСтрока.Префикс + ИндексДоч + ТекущаяСтрока.Постфикс;
			
			Ячейка = Справочники.ор_Ячейки.СоздатьЭлемент();
			Ячейка.Наименование = НаименованиеЯчейки;
			Ячейка.Владелец = Объект.Склад;
			Ячейка.УстановитьНовыйКод();
			
			Попытка
				Ячейка.Записать();
				КоличествоСозданныхЯчеек = КоличествоСозданныхЯчеек +1;
			Исключение
				ТекстТекущейОшибки = "- Ячейка "+НаименованиеЯчейки+": "+Символы.ПС+ОписаниеОшибки();
				ТекстОшибки = ТекстОшибки + ТекстТекущейОшибки + Символы.ПС;
				БылиОшибкиПриСозданииЯчеек = Истина;
				Продолжить;
			КонецПопытки
			
		ИначеЕсли ИндексСтроки+1 <= МаксУровень Тогда
			ОбходСтрокТаблицы(ИндексСтроки+1, Наименование, МаксУровень,Результат,КоличествоСозданныхЯчеек, ТекстОшибки)
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не БылиОшибкиПриСозданииЯчеек Тогда
		Результат = "Создание ячеек завершено!";
	Иначе
		Результат = "";
		Если КоличествоСозданныхЯчеек <> 0 Тогда
			Результат = "Успешно создано "+КоличествоСозданныхЯчеек+" ячеек."+ Символы.ВК + Символы.ПС;
		КонецЕсли;
		
		Результат = Результат + "При создании следующих ячеек произошли ошибки:" + Символы.ВК + Символы.ПС + ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
